package com.github.ckdgus08.domain.enum_;

public enum MajorType {
    국어국문학과,한문학과,노어노문학과,독어독문학과,불어불문학과,서어서문학과,언어학과,영어영문학과,일어일문학과,중어중문학과,문예창작학과,기타어문학과
    ,철학과,종교학과,사학과,고고학과,미술사학과,문화인류학과,문화재보존학과,한국학과
    ,법학과
    ,기독교학과,신학과,선교학과,불교학과,기타종교학과
    ,심리학과,사회학과,정치외교학과,북한학과,행정학과,경찰행정학과,아동가족학과,여성학과,지리학과,지적학과,도시학과,국제학부,문헌정보학과,문화콘텐츠학과,커뮤니케이션학과,비서학과
    ,군사학과,부사관과
    ,경영학과,경제학과,무역학과,소비자학과,회계학과,세무학과,부동산학과,금융보험학과,경영정보학과,관광학과,물류유통학과,광고홍보학과
    ,수학과,통계학과,생명과학과,화학과,물리학과,천문학과,해양학과,지질학과,대기과학과
    ,농생물학과,농업경제학과,식물자원학과,산림과학과,동물자원학과,특수동물학과,애완동물과,수산학과,수산생명의학과
    ,의류의상학과,식품영양학과,조리과학과,주거환경학과
    ,수의학과,의학과,치의학과,한의학과
    ,약학과,한약학과
    ,간호학과
    ,재활학과,언어치료학과,작업치료학과,물리치료학과,안경광학과,방사선학과,응급구조학과,임상병리학과,치위생학과,치기공학과,의료정보학과,보건행정학과,건강관리학과
    ,전기전자공학과,제어공학과,의공학과,광공학과,국방기술학과
    ,컴퓨터공학과,정보보안학과,인공지능학과,소프트웨어학과,멀티미디어학과,글로벌IT학과
    ,화학공학과,재료공학과,고분자공학과,섬유공학과,생명공학과,식품공학과,나노공학과,에너지공학과
    ,기계공학과,자동차공학과,조선해양공학과,항공우주공학과,기전공학과,철도공학과,금형설계공학과,특수장비과
    ,건축학과,건축공학과,토목공학과,교통공학과,농공학과,조경학과,환경공학과,안전공학과
    ,철도운전관제과,항해학과,기관학과,항공운항과,산업공학과,소방학과,원자력공학과,출판인쇄과
    ,교육학과,교육공학과,유아교육과,특수교육과
    ,초등교육과
    ,국어교육과,영어교육과,불어교육과,독어교육과,일어교육과,중국어교육과,한문교육과,문헌정보교육과
    ,지리교육과,역사교육과,일반사회교육과,윤리교육과
    ,과학교육과,수학교육과,환경교육과
    ,음악교육과,미술교육과,체육교육과,종교교육과
    ,기술교육과,가정교육과,농업교육과,수해양산업교육과,상업정보교육과,컴퓨터교육과
    ,서양화과,동양화과,산업디자인학과,시각디자인학과,종교미술학과,보석감정과
    ,귀금속공예과,도자공예과,조소과,섬유과,목형과,판화과
    ,작곡과,성악과,기악과,국악과,실용음악과,음악학과,교회음악과,음향과
    ,무용학과,체육학과,스포츠의학과,경호학과
    ,연극학과,영상영화학과,공연제작과,모델과
    ,사진학과,게임학과,만화애니메이션학과,미용학과
    ,자유전공학부,기타;
}
