package com.github.ckdgus08.domain.enum_;

public enum PurposeType {
    // 프로그램 명

    //공통
    _유튜브, _넷플릭스, _영화감상,
    _온라인강의, _화상회의, _zoom, _팀뷰어,
    _인터넷쇼핑, _웹서핑, _음악감상, _카카오톡,
    _주식, //_코딩
    // 문서작업
    _문서작업, _파워포인트,

    // 고급사양
    _인터넷방송송출, _OBS,

    //모바일 관련
    _모모앱플레이어, _녹스앱플레이어, _LD앱플레이어, _블루스택,

    // 개발
    _코딩,_웹개발, _앱개발, _VMware, _유니티, _언리얼,
    _비주얼스튜디오, _비주얼스튜디오코드, _이클립스, _인텔리제이, _안드로이드스튜디오, _스프링, _쥬피터,
    _데이터베이스관리, _가상머신, _패킷트레이서,

    // 인공지능
    _QGIS, _Tableau, _텐서플로우,


    // 공대
    _2D캐드, _3D캐드, _오토캐드, _솔리드웍스, _아두이노, _인벤터, _카티아, _퓨전360, _마스터캠, _ansys, _크레오,
    _3dsMax, _UG_NX, _피스파이스, _CAM, _orCad, _매트랩, _PLC,

    // 게임
    _저사양게임,
    _리그오브레전드, _메이플스토리, _카트라이더, _바람의나라, _마인크래프트, _피파온라인, _테일즈런너, _블랙서바이벌, _발로란트, _스타크래프트1,
    _롤토체스, _크레이지아케이드, _던전앤파이터, _풋볼매니저, _서든어택, _마비노기, _하스스톤, _사이퍼즈, _리니지, _거상, _디아블로,
    _검은사막, _문명, _로스트아크, _히어로즈오브스톰,
    _고사양게임,
    _배틀그라운드, _오버워치, _GTA, _포트나이트, _위쳐, _와우, _콜오브듀티, _심즈,
    _블레이드앤소울, _위닝, _아이온, _스타크래프트2,
    _레인보우식스시즈, _삼국지토탈워, _어쌔신크리드,
    _몬스터헌터월드, _파이널판타지, _스팀게임,
    // 건축
    _트윈모션, _스케치업, _ArchiCAD, _루미온, _브이레이, _레빗, _시네마4D,
    // 디자인 관련
    _블렌더, _지브러시, _마야, _라이노, _키샷, _클립스튜디오, _Painter, _베가스, _옥테인,
    //어도비
    _어도비, _어도비클라우드, _포토샵, _인디자인, _일러스트레이터, _애프터이펙트, _프리미어프로, _XD, _라이트룸, _파이널컷,

    // 영상 관련
    _영상편집, _파워디렉터, _무비메이커, _다빈치리졸브, _누크, _곰믹스,
    // 회계 관련
    _케이렙, _ERP,

    // 통계 관련
    _R프로그래밍, _AMOS, _SPSS, _STATA,

    // 음악 작업
    _큐베이스, _FL스튜디오, _가상악기, _음악작업, _에이블톤, _MIDI, _로직프로
}
